app/controllers/products_controller.rb

  def index
    @categories = []
    c_all = Category.find(:all, :include => :products, :order => :id)
    c_all.each do |c|
---
SELECT * FROM `products`

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 0)

   def edit
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`name`, `price`, `created_at`, `image_url`, `quantity`, `updated_at`, `special_price`, `category_id`, `unique`, `description`, `member_price`, `status`) VALUES('Laptop', 0.0, '2011-10-20 13:33:50', '', 0, '2011-10-20 13:33:50', NULL, NULL, NULL, 'portable laptop for users', NULL, NULL)

  def set_description_default
    Product.all.each do |p|
---
SELECT * FROM `products`