app/controllers/store_controller.rb

  def index
    #@category = Category.find(:all, :conditions => {:status => "Active"})
    @products = Product.find_products_for_sale_off
---
SELECT * FROM `products`

  def add_to_cart
    product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2011-10-21 14:19:18', 1, 1, 1, 5.0, '2011-10-21 14:19:18')
INSERT INTO `orders` (`name`, `address`, `creditcard`, `created_at`, `updated_at`, `pay_type`, `receiver`, `status`, `email`) VALUES('LongPH', 'HocMon', NULL, '2011-10-21 14:19:18', '2011-10-21 14:19:18', 'po', NULL, NULL, 'phanhoanglong2610@gmail.com')